tests/resources/cassettes/test_cancel_invoice.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - DUMMY
      Connection:
      - keep-alive
      Content-Type:
      - application/json
      User-Agent:
      - facturapi-python/0.0.1
    method: GET
    uri: https://www.facturapi.io/v1/invoices/INVOICE03
  response:
    body:
      string: '{"id":"INVOICE03","created_at":"2020-12-03T00:19:52.139Z","livemode":false,"verification_url":"https://verificacfdi.facturaelectronica.sat.gob.mx/default.aspx?id=9ca1bea3-b054-4f1f-9343-50e3531e1efa&re=AAA010101AAA&rr=VAUR631216M55&tt=42.050000&fe=8pa+Cw==","status":"valid","type":"I","cancellation_status":"none","customer":{"id":"CUSTOMER01","legal_name":"Remedios
        Varo","tax_id":"VAUR631216M55"},"total":42.05,"uuid":"9ca1bea3-b054-4f1f-9343-50e3531e1efa","use":"G01","folio_number":5,"payment_form":"04","payment_method":"PUE","currency":"MXN","exchange":1,"items":[{"quantity":1,"discount":0,"product":{"description":"Producto
        Test","product_key":"50202201","unit_key":"H87","unit_name":"Pieza","price":42.05,"tax_included":true,"taxes":[{"rate":0.16,"type":"IVA","withholding":false,"factor":"Tasa"}]}}]}'
    headers:
      Content-Length:
      - '829'
      Date:
      - Thu, 03 Dec 2020 00:29:16 GMT
      Server:
      - Google Frontend
      access-control-allow-origin:
      - '*'
      content-security-policy:
      - 'default-src ''self'';font-src https:;img-src data: https:;script-src ''unsafe-inline''
        https:;style-src https: ''unsafe-inline'';object-src ''none'';connect-src
        https:;frame-src https://js.stripe.com/;upgrade-insecure-requests'
      content-type:
      - application/json; charset=utf-8
      etag:
      - W/"348-d/4qyCnPQ/5S8deonlfvO+AOOJU"
      expect-ct:
      - max-age=0
      referrer-policy:
      - no-referrer
      strict-transport-security:
      - max-age=15552000; includeSubDomains
      vary:
      - Accept-Encoding
      x-cloud-trace-context:
      - 80091378206587d6b0bce14b695b19c1/16292089298168088707;o=1
      - 80091378206587d6b0bce14b695b19c1;o=1
      x-content-type-options:
      - nosniff
      x-dns-prefetch-control:
      - 'off'
      x-download-options:
      - noopen
      x-frame-options:
      - SAMEORIGIN
      x-permitted-cross-domain-policies:
      - none
      x-xss-protection:
      - '0'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - DUMMY
      Connection:
      - keep-alive
      Content-Length:
      - '0'
      Content-Type:
      - application/json
      User-Agent:
      - facturapi-python/0.0.1
    method: DELETE
    uri: https://www.facturapi.io/v1/invoices/INVOICE03
  response:
    body:
      string: '{"id":"INVOICE03","created_at":"2020-12-03T00:19:52.139Z","livemode":false,"verification_url":"https://verificacfdi.facturaelectronica.sat.gob.mx/default.aspx?id=9ca1bea3-b054-4f1f-9343-50e3531e1efa&re=AAA010101AAA&rr=VAUR631216M55&tt=42.050000&fe=8pa+Cw==","status":"valid","type":"I","cancellation_status":"pending","customer":{"id":"CUSTOMER01","legal_name":"Remedios
        Varo","tax_id":"VAUR631216M55"},"total":42.05,"uuid":"9ca1bea3-b054-4f1f-9343-50e3531e1efa","use":"G01","folio_number":5,"payment_form":"04","payment_method":"PUE","currency":"MXN","exchange":1,"items":[{"quantity":1,"discount":0,"product":{"description":"Producto
        Test","product_key":"50202201","unit_key":"H87","unit_name":"Pieza","price":42.05,"tax_included":true,"taxes":[{"rate":0.16,"type":"IVA","withholding":false,"factor":"Tasa"}]}}]}'
    headers:
      Content-Length:
      - '832'
      Date:
      - Thu, 03 Dec 2020 00:29:17 GMT
      Server:
      - Google Frontend
      access-control-allow-origin:
      - '*'
      content-security-policy:
      - 'default-src ''self'';font-src https:;img-src data: https:;script-src ''unsafe-inline''
        https:;style-src https: ''unsafe-inline'';object-src ''none'';connect-src
        https:;frame-src https://js.stripe.com/;upgrade-insecure-requests'
      content-type:
      - application/json; charset=utf-8
      etag:
      - W/"34b-5pl8uW0YPemgM6rFZEuM6MHiBzk"
      expect-ct:
      - max-age=0
      referrer-policy:
      - no-referrer
      strict-transport-security:
      - max-age=15552000; includeSubDomains
      vary:
      - Accept-Encoding
      x-cloud-trace-context:
      - 3a11b3ff851ad1e768c6f268232a83d9/16589076270882746040;o=1
      - 3a11b3ff851ad1e768c6f268232a83d9
      x-content-type-options:
      - nosniff
      x-dns-prefetch-control:
      - 'off'
      x-download-options:
      - noopen
      x-frame-options:
      - SAMEORIGIN
      x-permitted-cross-domain-policies:
      - none
      x-xss-protection:
      - '0'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - DUMMY
      Connection:
      - keep-alive
      Content-Type:
      - application/json
      User-Agent:
      - facturapi-python/0.0.1
    method: GET
    uri: https://www.facturapi.io/v1/invoices/INVOICE03
  response:
    body:
      string: '{"id":"INVOICE03","created_at":"2020-12-03T00:19:52.139Z","livemode":false,"verification_url":"https://verificacfdi.facturaelectronica.sat.gob.mx/default.aspx?id=9ca1bea3-b054-4f1f-9343-50e3531e1efa&re=AAA010101AAA&rr=VAUR631216M55&tt=42.050000&fe=8pa+Cw==","status":"canceled","type":"I","cancellation_status":"accepted","customer":{"id":"CUSTOMER01","legal_name":"Remedios
        Varo","tax_id":"VAUR631216M55"},"total":42.05,"uuid":"9ca1bea3-b054-4f1f-9343-50e3531e1efa","use":"G01","folio_number":5,"payment_form":"04","payment_method":"PUE","currency":"MXN","exchange":1,"items":[{"quantity":1,"discount":0,"product":{"description":"Producto
        Test","product_key":"50202201","unit_key":"H87","unit_name":"Pieza","price":42.05,"tax_included":true,"taxes":[{"rate":0.16,"type":"IVA","withholding":false,"factor":"Tasa"}]}}]}'
    headers:
      Content-Length:
      - '836'
      Date:
      - Thu, 03 Dec 2020 00:29:17 GMT
      Server:
      - Google Frontend
      access-control-allow-origin:
      - '*'
      content-security-policy:
      - 'default-src ''self'';font-src https:;img-src data: https:;script-src ''unsafe-inline''
        https:;style-src https: ''unsafe-inline'';object-src ''none'';connect-src
        https:;frame-src https://js.stripe.com/;upgrade-insecure-requests'
      content-type:
      - application/json; charset=utf-8
      etag:
      - W/"34f-3wJ5GpqtoQ3uXmn/ZUF02skZsN8"
      expect-ct:
      - max-age=0
      referrer-policy:
      - no-referrer
      strict-transport-security:
      - max-age=15552000; includeSubDomains
      vary:
      - Accept-Encoding
      x-cloud-trace-context:
      - 8a3bf63c2d7035abf88fe4dad0ecbe72/15960514803916258452
      - 8a3bf63c2d7035abf88fe4dad0ecbe72
      x-content-type-options:
      - nosniff
      x-dns-prefetch-control:
      - 'off'
      x-download-options:
      - noopen
      x-frame-options:
      - SAMEORIGIN
      x-permitted-cross-domain-policies:
      - none
      x-xss-protection:
      - '0'
    status:
      code: 200
      message: OK
version: 1
